LSMC211/SortWarrior/movingUnit_stm32f103c8t6/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define M1PWM_Pin GPIO_PIN_0
#define M1PWM_GPIO_Port GPIOA
#define M2PWM_Pin GPIO_PIN_1
#define M2PWM_GPIO_Port GPIOA
#define M1ENCA_Pin GPIO_PIN_6
#define M1ENCA_GPIO_Port GPIOA
#define M1ENCB_Pin GPIO_PIN_7
#define M1ENCB_GPIO_Port GPIOA
#define M1A_Pin GPIO_PIN_12
#define M1A_GPIO_Port GPIOB
#define M1B_Pin GPIO_PIN_13
#define M1B_GPIO_Port GPIOB
#define M2A_Pin GPIO_PIN_14
#define M2A_GPIO_Port GPIOB
#define M2B_Pin GPIO_PIN_15
#define M2B_GPIO_Port GPIOB
#define M2ENCA_Pin GPIO_PIN_6
#define M2ENCA_GPIO_Port GPIOB
#define M2ENCB_Pin GPIO_PIN_7
#define M2ENCB_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
